Revit 2026 API

# ScheduleDefinitionIsValidCombinedParameters Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidCombinedParameters(
	IList<TableCellCombinedParameterData> data
)
```
```vb
Public Function IsValidCombinedParameters (
	data As IList(Of TableCellCombinedParameterData)
) As Boolean
```
```cpp
public:
bool IsValidCombinedParameters(
	IList<TableCellCombinedParameterData^>^ data
)
```
```fsharp
member IsValidCombinedParameters :
        data : IList<TableCellCombinedParameterData> -> bool
```

#### Parameters

data IListTableCellCombinedParameterData

#### Return Value

Boolean

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace